## Loading the inline SQL display

In [1]:
%load_ext sql
%sql sqlite://

## Creating three tables below
- employee
- departments
- job titles

In [2]:
%%sql
CREATE TABLE employees (
  employee_id INT PRIMARY KEY,
  first_name VARCHAR(50),
  last_name VARCHAR(50),
  date_of_birth DATE,
  address VARCHAR(100),
  email_address VARCHAR(100),
  phone_number VARCHAR(20),
  department_id INT,
  job_title_id INT,
  FOREIGN KEY (department_id) REFERENCES departments(department_id),
  FOREIGN KEY (job_title_id) REFERENCES job_titles(job_title_id));

*  sqlite://
Done.

[]

In [3]:
%%sql
CREATE TABLE departments (
  department_id INT PRIMARY KEY,
  department_name VARCHAR(50));

*  sqlite://
Done.

[]

In [4]:
%%sql
CREATE TABLE job_titles (
  job_title_id INT PRIMARY KEY,
  job_title VARCHAR(50));

*  sqlite://
Done.

[]

## Adding some sample data

In [5]:
%%sql
INSERT INTO employees (employee_id, first_name, last_name, date_of_birth, address, email_address, phone_number, department_id, job_title_id)
VALUES
  (1, 'Emily', 'Garcia', '1990-05-01', '123 Broadway, New York, NY 10001', 'emily.garcia@example.com', '555-1234', 1, 1),
  (2, 'Daniel', 'Nguyen', '1988-12-15', '456 Lexington Ave, New York, NY 10017', 'daniel.nguyen@example.com', '555-5678', 1, 2),
  (3, 'Brianna', 'Patel', '1985-03-25', '789 Madison Ave, New York, NY 10021', 'brianna.patel@example.com', '555-9012', 2, 3),
  (4, 'Aiden', 'Smith', '1993-07-07', '321 5th Ave, New York, NY 10016', 'aiden.smith@example.com', '555-3456', 2, 4),
  (5, 'Olivia', 'Brown', '1980-11-18', '654 8th Ave, New York, NY 10036', 'olivia.brown@example.com', '555-7890', 3, 5),
  (6, 'Ethan', 'Carter', '1995-06-30', '987 Park Ave, New York, NY 10028', 'ethan.carter@example.com', '555-2345', 4, 6),
  (7, 'Sophia', 'Clark', '1982-09-22', '654 2nd Ave, New York, NY 10016', 'sophia.clark@example.com', '555-6789', 5, 7),
  (8, 'Lucas', 'Lopez', '1987-04-12', '321 1st Ave, New York, NY 10003', 'lucas.lopez@example.com', '555-0123', 5, 8);

*  sqlite://
8 rows affected.

[]

In [6]:
%%sql
INSERT INTO departments (department_id, department_name)
VALUES
  (1, 'Sales'),
  (2, 'Marketing'),
  (3, 'Finance'),
  (4, 'Human Resources'),
  (5, 'Information Technology');

*  sqlite://
5 rows affected.

[]

In [7]:
%%sql
INSERT INTO job_titles (job_title_id, job_title)
VALUES
  (1, 'Sales Representative'),
  (2, 'Sales Manager'),
  (3, 'Marketing Coordinator'),
  (4, 'Marketing Manager'),
  (5, 'Financial Analyst'),
  (6, 'Human Resources Generalist'),
  (7, 'IT Specialist'),
  (8, 'IT Manager');

*  sqlite://
8 rows affected.

[]

## Querying data

In [8]:
%%sql
-- Load all employees

SELECT * FROM employees

*  sqlite://
Done.

[(1, 'Emily', 'Garcia', '1990-05-01', '123 Broadway, New York, NY 10001', 'emily.garcia@example.com', '555-1234', 1, 1),
 (2, 'Daniel', 'Nguyen', '1988-12-15', '456 Lexington Ave, New York, NY 10017', 'daniel.nguyen@example.com', '555-5678', 1, 2),
 (3, 'Brianna', 'Patel', '1985-03-25', '789 Madison Ave, New York, NY 10021', 'brianna.patel@example.com', '555-9012', 2, 3),
 (4, 'Aiden', 'Smith', '1993-07-07', '321 5th Ave, New York, NY 10016', 'aiden.smith@example.com', '555-3456', 2, 4),
 (5, 'Olivia', 'Brown', '1980-11-18', '654 8th Ave, New York, NY 10036', 'olivia.brown@example.com', '555-7890', 3, 5),
 (6, 'Ethan', 'Carter', '1995-06-30', '987 Park Ave, New York, NY 10028', 'ethan.carter@example.com', '555-2345', 4, 6),
 (7, 'Sophia', 'Clark', '1982-09-22', '654 2nd Ave, New York, NY 10016', 'sophia.clark@example.com', '555-6789', 5, 7),
 (8, 'Lucas', 'Lopez', '1987-04-12', '321 1st Ave, New York, NY 10003', 'lucas.lopez@example.com', '555-0123', 5, 8)]

In [9]:
%%sql
-- Show all employees, their job title and corresponding department

SELECT employees.first_name, employees.last_name, job_titles.job_title, departments.department_name
FROM employees
LEFT JOIN job_titles ON employees.job_title_id = job_titles.job_title_id
LEFT JOIN departments ON employees.department_id = departments.department_id;

*  sqlite://
Done.

[('Emily', 'Garcia', 'Sales Representative', 'Sales'),
 ('Daniel', 'Nguyen', 'Sales Manager', 'Sales'),
 ('Brianna', 'Patel', 'Marketing Coordinator', 'Marketing'),
 ('Aiden', 'Smith', 'Marketing Manager', 'Marketing'),
 ('Olivia', 'Brown', 'Financial Analyst', 'Finance'),
 ('Ethan', 'Carter', 'Human Resources Generalist', 'Human Resources'),
 ('Sophia', 'Clark', 'IT Specialist', 'Information Technology'),
 ('Lucas', 'Lopez', 'IT Manager', 'Information Technology')]

In [10]:
%%sql
-- List all employees who were born before 1990

SELECT employees.first_name, employees.last_name, employees.date_of_birth, departments.department_name
FROM employees
LEFT JOIN departments ON employees.department_id = departments.department_id
WHERE employees.date_of_birth < '1990-01-01';

*  sqlite://
Done.

[('Daniel', 'Nguyen', '1988-12-15', 'Sales'),
 ('Brianna', 'Patel', '1985-03-25', 'Marketing'),
 ('Olivia', 'Brown', '1980-11-18', 'Finance'),
 ('Sophia', 'Clark', '1982-09-22', 'Information Technology'),
 ('Lucas', 'Lopez', '1987-04-12', 'Information Technology')]

In [11]:
%%sql
-- List all employees who were born after 1990 and currently work in Marketing

SELECT employees.first_name, employees.last_name, employees.date_of_birth, departments.department_name
FROM employees
LEFT JOIN departments ON employees.department_id = departments.department_id
WHERE employees.date_of_birth > '1990-01-01' AND departments.department_name = 'Marketing';

*  sqlite://
Done.

[('Aiden', 'Smith', '1993-07-07', 'Marketing')]